NurPech/Hannah/satellite-esp/sdkconfig.defaults
# Hannah Satellite — ESP32-S3 Default-Konfiguration
# Werte hier überschreiben den ESP-IDF-Default bei "idf.py set-target esp32s3"
# Gerätespezifische Werte (SSID, Passwort, Device-ID) in sdkconfig.local setzen
# (sdkconfig.local ist in .gitignore)

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash & PSRAM (ESP32-S3-WROOM-1-N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Audio — Sample-Rate und Frame-Größe
CONFIG_HANNAH_AUDIO_SAMPLE_RATE=16000
CONFIG_HANNAH_AUDIO_FRAME_MS=30

# I2S — Mic (INMP441 × 2)
CONFIG_HANNAH_MIC_I2S_PORT=0
CONFIG_HANNAH_MIC_BCK_GPIO=4
CONFIG_HANNAH_MIC_WS_GPIO=5
CONFIG_HANNAH_MIC_DATA_GPIO=6

# I2S — Speaker (MAX98357A)
CONFIG_HANNAH_SPK_I2S_PORT=1
CONFIG_HANNAH_SPK_BCK_GPIO=15
CONFIG_HANNAH_SPK_WS_GPIO=16
CONFIG_HANNAH_SPK_DATA_GPIO=7

# LED-Ring (WS2812B, 12 LEDs)
CONFIG_HANNAH_LED_GPIO=48
CONFIG_HANNAH_LED_COUNT=12

# Mute-Taster
CONFIG_HANNAH_MUTE_GPIO=0

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
